# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого
# элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
# а указать явно, в программе.

base_list = [12, 56.568, "hi", [1, "hello"], (87, 55), {123, 77}, {4: 12}, False, 5+3j, None]

for i in base_list:
    print(f"{i} - ", type(i))
