# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через dict.


month = input("введите месяц в виде целого числа от 1 до 12: ")

seasons = {
    "зима": ["1", "2", "12"],
    "весна": ["3", "4", "5"],
    "лето": ["6", "7", "8"],
    "осень": ["9", "10", "11"]
}

for key, value in seasons.items():
    for i in value:
        if month in value:
            print(key)
            break

