# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.

string = input("введите строку из нескольких слов, разделённых пробелами: ")
words = string.split()
n = 0
for i in words:
    n += 1
    print(f"{n} - {i[:10]}")


