# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника

revenue = int(input("введите значение выручки: "))
cost = int(input("введите значение издержек: "))
profit = revenue - cost

if revenue > cost:
    print(f"ваша прибыль {profit}")
    profitability = profit / revenue
    number_of_employees = int(input("введите количество сотрудников: "))
    profit_to_employee = profit / number_of_employees
    print(f"рентабельность выручки {profitability}")
    print(f"прибыль фирмы в расчете на одного сотрудника {profit_to_employee}")

elif revenue < cost:
    print(f"ваш убыток {profit*-1}")

else:
    print("выручка равна издержкам. вы отработали в ноль")

